<?php

$bigCity = [
    ["Нью-Йорк", "", "8175133"],
    ["Лос-Анджелес", "Калифорния", "3792621"],
    ["Чикаго", "Илинойс", "2695598"],
    ["Хьюстон", "Техас", "2100263"],
    ["Филадельфия", "Пенсильвания", "1526006"],
    ["Феникс", "Аризона", "1445632"],
    ["Сан-Антонио", "Техас", "1327407"],
    ["Сан-Диего", "Калифорния", "1307402"],
    ["Даллас", "Техас", "1197816"],
    ["Сан-Хосе", "Калифорния", "945942"]    
];

$sum = 0;
$KF = 0;
$TS = 0;

print "<table>\n";
for ($i = 0; $i <= count($bigCity) - 1; $i++){
  print "<tr>";
    for ($m = 0; $m <= count($bigCity[$i]) - 1; $m++){
        print "<td>" . $bigCity[$i][$m] . "</td>";
    }
    $sum += $bigCity[$i][2];
    if ($bigCity[$i][1] == "Калифорния"){
        $KF += $bigCity[$i][2]; 
    }
    elseif ($bigCity[$i][1] == "Техас"){
        $TS += $bigCity[$i][2]; 
    }
   print "</tr>\n";
}

print "<tr><td>Калифорния</td>" . "<td> --- </td>" . "<td>" . $KF . "<td></tr>\n"; 
print "<tr><td>Техас</td>" . "<td> --- </td>" . "<td>" . $TS . "<td></tr>\n"; 
print "<tr><td>Total</td>" . "<td> --- </td>" . "<td>" . $sum . "<td></tr>\n";
print "</table>";